/* 
Написать программу, которая сначала спрашивает имя героя, имя злодея, название места действия, причину конфликта,
оружие героя, способность злодея и т.д., а затем выдаёт текст-сказку с подстановками прочитанных значений в соответствующих местах.
*/

#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	string name1, name2, name3, place, cause, weapon, power;
	cout << "Как зовут героя?\n";
	cin >> name1;
	cout << "Как звали его возлюбленную?\n";
	cin >> name2;
	cout << "Кто противник героя?\n";
	cin >> name3;
	cout << "Где находится место действия?\n";
	cin >> place;
	cout << "Какое оружие у героя?\n";
	cin >> weapon;
	cout << "Какой способностью обладает злодей?\n";
	cin >> power;
	cout << "\nЖили-были не тужили " << name1 << " и " << name2 << ".";
	cout << "Все у них было хорошо, до тех пор, пока красавицу не похитил злой " << name3 << ".";
	cout << "Забрал он ее к себе в " << place << ".";
	cout << "Решил " << name1 << " освободить любимую. Взял он с собой " << weapon << " , чтобы одолеть врага.";
	cout << "Но " << name3 << "оказался не хухры-мухры. Обладал он способностью " << power << ".";
	cout << "Афигел, конечно, " << name1 << ", в глазах потемнело, коленочки затряслись.";
	cout << "Но была не была, подумал " << name1 << " замахнулся своим чудо-оружием и ударил.";
	cout << "Не ожидал" << name3 << " такой силушки богатырской, испугался и ушел пить пиво.";
	cout << "А " << name1 << " и " << name2 << "вернулись домой и продолжили жить не тужить.\n";
	return 0;
}
